# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'mas' # Mac App Store manager
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'tree' # List directories in a tree structure
brew 'zsh' 
brew 'youtube-dl'
brew 'ffmpeg' # a libray for working with video
brew 'fortune' # Get Quotes
brew 'cowsay'
brew 'tldr' #explain command line command.


# Development
brew 'php'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'postgres'
brew 'mongodb/brew/mongodb-community'

# Apps
cask 'raycast 
cask 'discord' 
cask 'docker' 
cask 'google-chrome' 
cask 'insomnia' 
cask 'tableplus' 
cask 'iterm2' 
cask 'firefox' 
cask 'tinkerwell' 
cask 'mpv' 
cask 'whatsapp' 
cask 'time-out' 
cask 'karabiner-elements' 
cask 'mongodb-compass' 
cask 'notion' 
cask 'maccy' 
cask 'fig' 
cask 'postman' 
cask 'bitwarden' 
cask 'clocker' 
cask 'loom' 
cask 'firefox'
cask 'github'
cask 'slack'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'


# Fonts
cask 'font-lato' 
cask 'font-open-sans' 
cask 'font-roboto' 
cask 'font-roboto-condensed' 
cask 'font-source-code-pro-for-powerline' 
cask 'font-source-code-pro' 
cask 'font-source-sans-pro' 
cask 'font-source-serif-pro' 

# Mac App Store
mas 'Things', id: 904280696
